README.md

# Table of Contents

1.  [Notas a esta entrega](#orgdb61c9c)
2.  [Notas Generales](#org2e610a1)
3.  [Organización del proyecto](#orgae46a06)



<a id="orgdb61c9c"></a>

# Notas a esta entrega

-   Instancia de modelo de productos exportado desde schemaProducto.js (antes se instanciaba en el manager de productos).
-   Agregadas opciones de paginación a manager de productos
-   Agregadas opciones de paginación al método get del router de productos por query params:
    -   /api/products?limit=5&page=2&sort=asc devuelve la segunda página de a cinco productos de la categoría ordenados por precio en forma ascendente por precio.


<a id="org2e610a1"></a>

# Notas Generales


<a id="orgae46a06"></a>

# Organización del proyecto

